\chapter{Teoria}
\label{cha:wstep}

Aby móc zagłębić się w temat, należy najpierw wyjaśnić, jak działają poszczególne rozwiązania wykorzystywane w procesorach oraz jak dane są pobierane przez procesor.

\section{Przetwarzanie potokowe (ang. \textit{pipelining})}

Wykonywanie instrukcji przez procesor składa się z kilku etapów. W zależności od procesora może być ich różna ilość. Etapy, które musi wykonać procesor, to:

\begin{itemize}
	\item Pobieranie instrukcji (ang. \textit{IF -- instruction fetch}),
	\item Dekodowanie instrukcji (ang. \textit{ID -- instruction decode}),
	\item Wykonywanie instrukcji (ang. \textit{EX -- execute}),
	\item Zapisywanie rezultatu (ang. \textit{WB -- writeback}).
\end{itemize}


\begin{figure}[!h]
	\centering
	\includegraphics[width=0.7\textwidth]{images/sequential2}
	\caption{Przepływ wykonywania instrukcji przez procesor sekwencyjny \cite{ModernMicroprocessors90MinGuide}.}
\end{figure}

Nowoczesne procesory, zamiast przetwarzać instrukcje sekwencyjnie, wykonują każdy etap równolegle, ale dla różnych instrukcji. Gdy rezultat jednej instrukcji jest zapisywany, to inna się wykonuje, inna jest dekodowana oraz kolejna jest pobierana. Proces ten nazywamy przetwarzaniem potokowym i~przypomina on linię produkcyjną:


\begin{figure}[!h]
	\centering
	\includegraphics[width=0.7\textwidth]{images/pipelined2}
	\caption{Przepływ wykonywania instrukcji przez procesor potokowy \cite{ModernMicroprocessors90MinGuide}.}
\end{figure}


Kompilatory języków takich jak C czy C++ wyrównują dane w~sposób przedstawiony w~tabeli \ref{tab:CDataAlignment}.

\begin{table}[!h]
	\centering
    \caption{Typowe wyrównanie danych na 32 oraz 64 bitowych procesorach na systemie Linux przez kompilator firmy Intel~\cite{IntelDataAlignment}.}
    \label{tab:CDataAlignment}
	\begin{tabular}{|c|4|4|}
		\hline
		Typ danych & Wyrównanie na procesorze 32-bit (w~bajtach) & Wyrównanie na procesorze 64-bit (w~bajtach) 
		\\ \hline \hline
		char & 1 & 1
		\\ \hline
		short & 2 & 2
		\\ \hline
		int & 4 & 4
		\\ \hline
		long & 8 & 8
		\\ \hline
		float & 4 & 4
		\\ \hline
		double & 8 & 8
		\\ \hline
		long long & 8 & 8
		\\ \hline
		long double & 4 & 16
		\\ \hline
		dowolny wskaźnik & 4 & 8
		\\ \hline
	\end{tabular}
\end{table}

\subsection{Wyrównanie danych w strukturach}

Gdy struktura przechowuje elementy różnych typów, kompilator wstawia nieużywaną pamięć pomiędzy nie, aby je wyrównać. Proces ten nazywany jest dopełnieniem (ang. \textit{padding}). Zwiększa on~wydajność dostępu do~danych kosztem zwiększenia używanej pamięci.

Dopełnienie może także wystąpić na~końcu struktury, w~celu wyrównania jej samej (dzieje się tak w~przykładzie zawartym w~listingach \ref{lst:PaddingExample}, \ref{lst:ClangPaddingExample} oraz \ref{lst:GccPaddingExample}) \cite{IntelDataAlignment}.

Aby poznać faktyczne ułożenie danych przez kompilator, można skorzystać z~odpowiedniej flagi kompilatora clang lub dodatku do debuggera gdb o~nazwie \href{https://github.com/PhilArmstrong/pahole-gdb}{pahole-gdb (dostęp w~dniu 2015-12-15)}. Istnieje także dedykowana aplikacja pahole, lecz nie wspiera ona standardu c++11.

W listingach \ref{lst:ClangPaddingExample} oraz \ref{lst:GccPaddingExample} przedstawiono ułożenie danych przez kompilator clang++-3.6  oraz~\mbox{g++-5.2.1} dla przykładu z listingu \ref{lst:PaddingExample}. Program został skompilowany na 64-bitowym systemie Ubuntu 15.10.

\clearpage % TODO / FIXME

\begin{lstlisting}[
    caption=Program z przykładową strukturą danych., label=lst:PaddingExample
]
struct S {
    int a;
    bool b;
    int* c;
    bool e;
    int f;
    bool g;
    int h;
    bool i;
};

int main() {
    // Poniżej wykorzystano obiekt struktury oraz jego rozmiar.
    // Instrukcje te są wymagane dla funkcjonalności wyświetlenia 
    // organizacji struktury przez clang oraz pahole-gdb.
    S s;
    return sizeof(S);
}
\end{lstlisting}


\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    caption={Ułożenie danych oraz padding przez kompilator clang++-3.6. Pierwsza kolumna oznacza z ang. \textit{offset} -- przesunięcie względem początku struktury. Dodatkowe informacje o~strukturze prezentowane są na końcu\protect\footnotemark.}, 
    label=lst:ClangPaddingExample
]
$ clang++-3.6 -cc1 -fdump-record-layouts struct_S.cpp 

*** Dumping AST Record Layout
0  | struct S
0  |   int a
4  |   _Bool b
8  |   int * c
16 |   _Bool e
20 |   int f
24 |   _Bool g
28 |   int h
32 |   _Bool i
   | [sizeof=40, dsize=40, align=8
   |  nvsize=40, nvalign=8]
\end{lstlisting}

\footnotetext{Sizeof -- rozmiar struktury. Dsize -- rozmiar danych (bez dopełnienia na końcu struktury). Align -- wyrównanie obiektów struktury. Nvsize -- rozmiar struktury bez uwzględnienia wskaźnika na tablicę funkcji wirtualnych (jeśli struktura takowy posiada). Nvalign -- wypełnienie bez uwzględnienia wskaźnika na tablicę funkcji wirtualnych.}

\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    keywords={},
    caption={Ułożenie danych oraz padding przez kompilator g++ 5.2.1.  Dodatek pahole-gdb w~przypadku linii zawierającej deklarację struktury wyświetla jej całkowity rozmiar. W przypadku linii zawierających pola, wyświetlane są dodatkowo przesunięcie względem początku struktury, rozmiar danego pola oraz -- jeżeli występuje -- informacja o rozmiarze ,,dziury'', czyli dopełnienia, aby następne pole było wyrównane.}, label=lst:GccPaddingExample
]   
$ g++ -std=c++11 -g struct_S.cpp -o exec
$ gdb --quiet ./exec
Reading symbols from ./exec...done.
(gdb) pahole S
/*   40     */ struct S {
/*   0    4 */    int a
/*   4    1 */    bool b
/* XXX 24 bit hole, try to pack */
/*   8    8 */    int * c
/*  16    1 */    bool e
/* XXX 24 bit hole, try to pack */
/*  20    4 */    int f
/*  24    1 */    bool g
/* XXX 24 bit hole, try to pack */
/*  28    4 */    int h
/*  32    1 */    bool i
} 
\end{lstlisting}

Jak można zaobserwować, oba kompilatory ułożyły dane tak samo. W obu przypadkach, na~dopełnienie trzech zmiennych typu \texttt{bool} zmarnowane zostały 72 bity.

Zmarnowane miejsce można zaoszczędzić, zmieniając kolejność pól w strukturze danych --~ustawiając je od największego rozmiaru pola do najmniejszego \footnote{Jest to generalna zasada. Są jednak przypadki, w których, pomimo nie zastosowania się do tej zasady, da~się uzyskać optymalny rozmiar struktury (zawierający najmniejsze możliwe dopełnienie lub jego brak).}.

Oszczędność miejsca w ten sposób zwiększa oczywiście wydajność -- przykładowo, w~przypadku wykorzystania tablicy struktur, więcej elementów zmieści się w jednej linii cache. Ułożenie takie zostało przedstawione w listingu \ref{lst:GoodPaddingExample} wraz z organizacją struktury -- dla kompilatora clang w listingu \ref{lst:ClangGoodPaddingExample} oraz~g++  w~listingu \ref{lst:GccGoodPaddingExample}.

\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    caption={Wydajniejsze ułożenie danych. Pola zostały rozlokowane od największego do najmniejszego rozmiaru.},
    label=lst:GoodPaddingExample
]
struct S {
	int* c;
	int a;
	int f;
	int h;
	bool b;
	bool e;
	bool g;
	bool i;
};
\end{lstlisting}


\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    keywords={},
    caption={Ułożenie danych przez kompilator clang. Pola zostały rozlokowane od największego do najmniejszego rozmiaru.}, label=lst:ClangGoodPaddingExample
]
$ clang++-3.6 -cc1 -fdump-record-layouts struct_S_good.cpp 

*** Dumping AST Record Layout
0  | struct S
0  |   int * c
8  |   int a
12 |   int f
16 |   int h
20 |   _Bool b
21 |   _Bool e
22 |   _Bool g
23 |   _Bool i
   | [sizeof=24, dsize=24, align=8
   |  nvsize=24, nvalign=8]
\end{lstlisting}


\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    keywords={},
    caption={Ułożenie danych przez kompilator g++. Pola zostały rozlokowane od największego do najmniejszego rozmiaru.},
    label=lst:GccGoodPaddingExample
]
$ g++ -std=c++11 -g struct_S_good.cpp -o exec
$ gdb --quiet ./exec
Reading symbols from ./exec...done.
(gdb) pahole S
/*   24     */ struct S {
/*   0    8 */    int * c
/*   8    4 */    int a
/*  12    4 */    int f
/*  16    4 */    int h
/*  20    1 */    bool b
/*  21    1 */    bool e
/*  22    1 */    bool g
/*  23    1 */    bool i
}
\end{lstlisting}

Tym razem w obu przypadkach struktura zajmuje 24 bajty i nie posiada żadnego dopełnienia.

\subsection{Zmiana wyrównania}

Istnieją uzasadnione przypadki, gdy należy zmienić wyrównanie struktury, bądź jej pól. Przykładem takim może być implementacja niskopoziomowych sterowników, gdy dane urządzenie wymaga odpowiedniej organizacji danych.

W ogólnym przypadku raczej się tego nie stosuje, ze względu na utratę wydajności, co zostało pokazane w rozdziale \ref{cha:DataAlignment}.

W kompilatorze Microsoft Visual C++, wyrównanie można zmienić poprzez dyrektywę preprocesora \texttt{\#pragma pack}, a w gcc oraz clang oprócz \texttt{\#pragma pack} można także wykorzystać specjalny atrybut \texttt{\_\_attribute\_\_((packed))}.

W listingach \ref{lst:PackedDataStructure}, \ref{lst:ClangPackedDataStructure} oraz \ref{lst:GccPackedDataStructure} pokazano organizację danych upakowanej struktury z listingu \ref{lst:PaddingExample}.

\begin{lstlisting}[
    aboveskip={0.5\baselineskip},
    caption={Upakowana struktura danych.},
    label=lst:PackedDataStructure
]
// ustawienie wyrównania do jednego bajtu
#pragma pack(1)
struct S {
    int a;
    bool b;
    int* c;
    bool e;
    int f;
    bool g;
    int h;
    bool i;
};
// przywrócenie domyślnego ustawienia wyrównania
#pragma pack()

int main() {
    S s;
    return sizeof(S);
}
\end{lstlisting}

\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    keywords={},
    caption={Upakowana organizacja danych przez kompilator clang.},
    label=lst:ClangPackedDataStructure
]
$ clang++-3.6 -cc1 -fdump-record-layouts struct_S_packed.cpp

*** Dumping AST Record Layout
0  | struct S
0  |   int a
4  |   _Bool b
5  |   int * c
13 |   _Bool e
14 |   int f
18 |   _Bool g
19 |   int h
23 |   _Bool i
   | [sizeof=24, dsize=24, align=1
   |  nvsize=24, nvalign=1]
\end{lstlisting}
\clearpage %TODO
\begin{lstlisting}[
    numbers=none,
    aboveskip={0.5\baselineskip},
    language={bash},
    keywords={},
    caption={Upakowana organizacja danych przez kompilator g++.},
    label=lst:GccPackedDataStructure
]
$ g++ -g -std=c++11 struct_S_packed.cpp -o exec
$ gdb --quiet ./exec
Reading symbols from ./exec...done.
(gdb) pahole S
/*   24     */ struct S {
/*   0    4 */    int a
/*   4    1 */    bool b
/*   5    8 */    int * c
/*  13    1 */    bool e
/*  14    4 */    int f
/*  18    1 */    bool g
/*  19    4 */    int h
/*  23    1 */    bool i
}
\end{lstlisting}
